app/controllers/diet_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'test@test.com') LIMIT 1
---
  def mydiet
    if !session[:user_id]
      redirect_to :controller=>'user', :action=> 'login'
      return
    end
        current_user = User.find(:first, :conditions => {:email => session[:user_id]})