app/controllers/index_controller.rb

SELECT * FROM `articles` ORDER BY articles.id DESC LIMIT 1
---
       def index
    @articles = Article.all