app/controllers/user_controller.rb

SELECT * FROM `users` WHERE (email = 'test1@test.com' and password = 'test') LIMIT 1
---
  def authenticate
          @user = User.new(params[:userform])
          valid_user = User.find(:first,:conditions => ["email = ? and password = ?",@user.email, @user.password])

SELECT * FROM `weights` WHERE (`weights`.`id` = '--- :weight_lb\n' AND (`weights`.`email` = 'test@test.com'))
SELECT * FROM `users` WHERE (`users`.`email` = 'test@test.com') LIMIT 1
---
    def mypage
        if session[:user_id].nil?
		  redirect_to :action=> 'login'
          return
        end
        @all_weights = Weight.find(:all, :order => "updated_at ASC", :conditions => {:email => session[:user_id]})
        @current_user = User.find(:first, :conditions => {:email => session[:user_id]})

SELECT * FROM `users` WHERE (email = 'test5@test.com' and password = '') LIMIT 1
INSERT INTO `users` (`dob`, `updated_at`, `firstname`, `height_cm`, `sex`, `ip`, `weight_lb`, `password`, `email`, `opt_in`, `created_at`) VALUES('1995-06-24', '2010-06-24 11:01:44', 'admin', 180, '1', '127.0.0.1', 160, 'admin', 'admin@dieteaser.com', '0', '2010-06-24 11:01:44')
INSERT INTO `weights` (`updated_at`, `weight_lb`, `email`, `created_at`) VALUES('2010-06-24 11:01:43', 160, 'admin@dieteaser.com', '2010-06-24 11:01:43')
---
      def authenticate_new_user
        @allusers = User.find(:all, :conditions => {:email => params[:userform][:email]})
        if !@allusers.empty?
          flash[:notice] = "we already have that email address sorry"
          redirect_to :action=> 'signup'
        else
        params[:userform][:ip] = request.remote_ip
		@user = User.new(params[:userform])
		@weight = Weight.new(:email => params[:userform][:email], :weight_lb => params[:userform][:weight_lb])
		@weight.save

INSERT INTO `weights` (`weight_lb`, `email`, `created_at`, `updated_at`) VALUES(190, 'test8@test.com', '2010-06-20 20:59:06', '2010-06-20 20:59:06')
---
    def newweight
      @weight =  Weight.new(:email => session[:user_id], :weight_lb =>params[:updateform][:weight_lb])
      @weight.save